require 'csv'
require 'httparty'

response = HTTParty.get("https://b7b232283836b5124bc13e40b1299be2:0f66356e3fd198115d2698a710db71f1@thaidiycupcake.myshopify.com/admin/products.json?page=1").body


json_res = JSON.parse(response)
product_json = json_res["products"] # this is an array of product


total = product_json.count
CSV.open("file.csv", "wb") do |csv|
    (-1..(total-1)).each do | i |
      if i == -1
          csv << ["เลข id หมวดหมู่สินค้า่",
          "ชื่อสินค้า่",
          "รายละเอียด",
          "่ราคา",
          "สินค้าคงคลัง",
          "น้ำหนักสินค้า",
          "ระยะเวลาเตรียมวัสดุ",
          "เลขอ้างอิงหน่วยสต็อกสินค้าหลัก(Parent SKU Reference No.)",
          "ตัวเลือกสินค้า 1: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 1: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 1: ราคา",
          "ตัวเลือกสินค้า 1: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 1: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 2: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 2: ราคา",
          "ตัวเลือกสินค้า 2: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 2: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 3: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 3: ราคา",
          "ตัวเลือกสินค้า 3: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 3: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 4: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 4: ราคา",
          "ตัวเลือกสินค้า 4: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 1: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 5: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 5: ราคา",
          "ตัวเลือกสินค้า 5: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 5: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 6: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 6: ราคา",
          "ตัวเลือกสินค้า 6: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 6: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 7: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 7: ราคา",
          "ตัวเลือกสินค้า 7: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 7: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 8: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 8: ราคา",
          "ตัวเลือกสินค้า 8: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 8: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 9: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 9: ราคา",
          "ตัวเลือกสินค้า 9: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 9: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 10: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 10: ราคา",
          "ตัวเลือกสินค้า 10: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 10: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 11: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 11: ราคา",
          "ตัวเลือกสินค้า 11: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 11: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 12: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 12: ราคา",
          "ตัวเลือกสินค้า 12: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 12: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 13: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 13: ราคา",
          "ตัวเลือกสินค้า 13: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 13: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 14: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 14: ราคา",
          "ตัวเลือกสินค้า 14: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 14: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)",
          "ตัวเลือกสินค้า 15: ชื่อตัวเลือกสินค้า",
          "ตัวเลือกสินค้า 15: ราคา",
          "ตัวเลือกสินค้า 15: สินค้าคงคลัง",
          "ตัวเลือกสินค้า 15: เลขอ้างอิงหน่วยสต็อกสินค้า(SKU Ref. No.)"
          ]
          next    
      end
      product = product_json[i]
      id = "1"
      title = product["title"]
      description = product["body_html"]
      price = product["variants"][0]["price"]
      inventory = product["variants"][0]["inventory_quantity"]
      weight = "0.1"
      prepare_time = ""
      sku = product["variants"][0]["sku"]
      v_sku=[]
      v_title=[]
      v_price =[]
      v_inventory =[]
      (0..14).each do |m|
        if product["variants"][m+1] 
            v_sku[m] = product["variants"][m+1]["sku"]
            v_title[m] = product["variants"][m+1]["sku"]
            v_price[m] = product["variants"][m+1]["title"]  
            v_inventory[m] = product["variants"][m+1]["inventory_quantity"]                
        else
            v_sku[m] =  ""
            v_title[m] =  ""
            v_price[m] = ""
            v_inventory[m] = ""
        end 
      end

      csv << [id,
          title,
          description,
          price,
          inventory,
          weight,
          prepare_time,
          sku,
          v_sku[0],
          v_title[0],
          v_price[0],
          v_inventory[0],
          v_sku[1],
          v_title[1],
          v_price[1],
          v_inventory[1],
          v_sku[2],
          v_title[2],
          v_price[2],
          v_inventory[2],
          v_sku[3],
          v_title[3],
          v_price[3],
          v_inventory[3],
          v_sku[4],
          v_title[4],
          v_price[4],
          v_inventory[4],
          v_sku[5],
          v_title[5],
          v_price[5],
          v_inventory[6],
          v_sku[6],
          v_title[6],
          v_price[6],
          v_inventory[6],
          v_sku[7],
          v_title[7],
          v_price[7],
          v_inventory[7],
          v_sku[8],
          v_title[8],
          v_price[8],
          v_inventory[8],
          v_sku[9],
          v_title[9],
          v_price[9],
          v_inventory[9],
          v_sku[10],
          v_title[10],
          v_price[10],
          v_inventory[10],
          v_sku[11],
          v_title[11],
          v_price[11],
          v_inventory[11],
          v_sku[12],
          v_title[12],
          v_price[12],
          v_inventory[12],
          v_sku[13],
          v_title[13],
          v_price[13],
          v_inventory[13],
          v_sku[14],
          v_title[14],
          v_price[14],
          v_inventory[14]
          ]
    end
end
